softwares/proxychains.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-15 三 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>proxychains</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">proxychains</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc26decc">1. 概述</a>
<ul>
<li><a href="#orgbea553a">1.1. 什么时候使用呢？</a></li>
<li><a href="#org326d14a">1.2. 一些很酷的功能：</a></li>
</ul>
</li>
<li><a href="#orgafe6659">2. 安装</a>
<ul>
<li><a href="#orge99f8cf">2.1. 源码</a></li>
<li><a href="#orgc9c1e7e">2.2. debian</a></li>
</ul>
</li>
<li><a href="#org9ad31b8">3. 配置</a></li>
<li><a href="#org26b79fc">4. 使用</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc26decc" class="outline-2">
<h2 id="orgc26decc"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/rofl0r/proxychains-ng">proxychains-ng</a> 是一个 UNIX 程序，它通过预加载的 DLL（dlsym()，LD_PRELOAD）hook 动态链接程序中与网络相关的 libc 函数，然后通过 SOCKS4a/5 或 HTTP 代理重定向连接。它仅支持 TCP（不支持 UDP/ICMP 等）。
</p>

<p>
它的工作方式基本上是 HACK；所以有可能无法适配您的程序，特别是脚本或启动许多进程的程序，例如后台守护程序或使用 dlopen()进行加载“模块”。
</p>

<p>
它应与简单的已编译（C/C++）动态链接程序一起使用。
</p>

<p>
如果您的程序不适用于代理链，请考虑使用 基于 iptables 的解决方案；这要强大得多。
</p>

<p>
支持的平台：Linux，BSD，Mac。
</p>
</div>

<div id="outline-container-orgbea553a" class="outline-3">
<h3 id="orgbea553a"><span class="section-number-3">1.1</span> 什么时候使用呢？</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>当从局域网连接“外部”的唯一方法是通过代理服务器。</li>
<li>从筛选出端口的限制性防火墙后面出来。</li>
<li>要在链中使用两个（或多个）代理： 如：your_host &lt;-&gt; proxy1 &lt;-&gt; proxy2 &lt;-&gt; target_host</li>
<li>“代理”某些没有内置代理支持的程序（例如 telnet）</li>
<li>通过代理从外部访问 Intranet。</li>
<li>在代理后面使用 DNS。</li>
<li>访问隐藏的洋葱服务。</li>
</ul>
</div>
</div>
<div id="outline-container-org326d14a" class="outline-3">
<h3 id="org326d14a"><span class="section-number-3">1.2</span> 一些很酷的功能：</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>该程序可以在同一链中混合使用不同的代理类型如：your_host &lt;-&gt; socks5 &lt;-&gt; http &lt;-&gt; socks4 &lt;-&gt; target_host</li>
<li>支持不同的链路选项
<ul class="org-ul">
<li>随机顺序</li>
<li>确切顺序</li>
<li>动态顺序（智能从链中排除死代理）</li>
</ul></li>
<li>可以将其用于大多数 TCP 客户端应用程序，甚至可以用于网络扫描程序，只要它们使用标准的 libc 功能。基于 pcap 的扫描不起作用。</li>
<li>可以将其与 squid，sendmail 等服务器一起使用。</li>
<li>通过代理解析 DNS。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgafe6659" class="outline-2">
<h2 id="orgafe6659"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge99f8cf" class="outline-3">
<h3 id="orge99f8cf"><span class="section-number-3">2.1</span> 源码</h3>
<div class="outline-text-3" id="text-2-1">
<p>
需要一个有效的 C 编译器，最好是 gcc
</p>
<div class="org-src-container">
<pre class="src src-sh">  ./configure --prefix=/usr --sysconfdir=/etc
  make &amp;&amp; make install &amp;&amp; make install-config (installs proxychains.conf)
</pre>
</div>
<p>
如果不安装，则可以使用 build 目录中的 proxychains：
</p>
</div>
</div>

<div id="outline-container-orgc9c1e7e" class="outline-3">
<h3 id="orgc9c1e7e"><span class="section-number-3">2.2</span> debian</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">apt install proxychains4
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9ad31b8" class="outline-2">
<h2 id="org9ad31b8"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<p>
proxychains 按以下顺序查找配置文件：
</p>
<ol class="org-ol">
<li>环境变量 <code>PROXYCHAINS_CONF_FILE</code> 中列出的文件或 作为-f 参数提供给 proxychains 脚本或二进制文件。</li>
<li><code>./proxychains.conf</code></li>
<li><code>$(HOME)/.proxychains/proxychains.conf</code></li>
<li><code>$(sysconfdir)/proxychains.conf</code> ，通常是 <code>/etc/proxychains.conf</code></li>
</ol>
</div>
</div>

<div id="outline-container-org26b79fc" class="outline-2">
<h2 id="org26b79fc"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">proxychains4 -f src/proxychains.conf telnet google.com 80
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">prxoychaing4 open -a <span style="color: #ff4ea3;">"App"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-07-15 三 10:27</p>
<p class="validation"></p>
</div>
</body>
</html>
